marcosandremsfilho/STM32/MotorClass/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */
void mainCpp();
/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_Pin1_Pin GPIO_PIN_4
#define LED_Pin1_GPIO_Port GPIOC
#define LED_Pin2_Pin GPIO_PIN_5
#define LED_Pin2_GPIO_Port GPIOC
#define LED_Pin3_Pin GPIO_PIN_0
#define LED_Pin3_GPIO_Port GPIOB
#define LED_Pin4_Pin GPIO_PIN_1
#define LED_Pin4_GPIO_Port GPIOB
#define MOTOR2_Pin2_Pin GPIO_PIN_8
#define MOTOR2_Pin2_GPIO_Port GPIOC
#define MOTOR2_Pin1_Pin GPIO_PIN_9
#define MOTOR2_Pin1_GPIO_Port GPIOC
#define MOTOR2_PWM_Pin GPIO_PIN_8
#define MOTOR2_PWM_GPIO_Port GPIOA
#define MOTOR1_PWM_Pin GPIO_PIN_9
#define MOTOR1_PWM_GPIO_Port GPIOA
#define MOTOR1_Pin2_Pin GPIO_PIN_10
#define MOTOR1_Pin2_GPIO_Port GPIOA
#define MOTOR1_Pin1_Pin GPIO_PIN_11
#define MOTOR1_Pin1_GPIO_Port GPIOA
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
